<a href="https://colab.research.google.com/github/R-Allecks/SENAI_Python/blob/main/SQLite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

In [ ]:
conn = sqlite3.connect('test.db')
print("conexao aberta")

In [ ]:
conn.execute('''
CREATE TABLE IF NOT EXISTS Empregado (
  matr√≠cula integer PRIMARY KEY AUTOINCREMENT,
  NOME string,
  CPF
  );
  ''')

conn.commit()
print("Tabela criada com sucesso")

In [ ]:
conn.execute("INSERT INTO Empregado VALUES(1,'THIAGO MEDEIROS',000)")
conn.execute("INSERT INTO Empregado VALUES(2,'MIGUEL MEDEIROS',111)")
conn.execute("INSERT INTO Empregado VALUES(3,'THALITA BARROS',222)")
conn.execute("INSERT INTO Empregado VALUES(4,'MARIA DE FATIMA',333)")

In [ ]:
cursor = conn.execute('''
SELECT  NOME, CPF
from EMPREGADO;
''')

In [ ]:
for row in cursor:
  print(row)

In [ ]:
import pandas as pd

qry = """
SELECT * FROM Empregado
"""

df = pd.read_sql_query(qry, conn)
df.head()

In [ ]:
import sqlite3
conn = sqlite3.connect('test2.db')
print("conexao aberta")

In [ ]:
conn.execute('''
CREATE TABLE IF NOT EXISTS DF (
  CustomerID integer PRIMARY KEY,
  NOME string
  );
''')
conn.commit()
print("Tabela criada com sucesso")

In [ ]:
conn.execute("INSERT INTO DF VALUES (1, 'Doe');")
conn.execute("INSERT INTO DF VALUES (2, 'Jo');")
conn.execute("INSERT INTO DF VALUES (3,'Tod');")

In [ ]:
conn.commit()

In [ ]:
import pandas as pd

qry = """
SELECT * FROM DF
"""

df = pd.read_sql_query(qry, conn)
df.head()

In [ ]:
import pandas as pd

qry = """
SELECT * FROM DF LIMIT 2
"""

df = pd.read_sql_query(qry, conn)
df.head()